In [12]:
import pandas as pd
import numpy as np

In [18]:
# [[1개만 넣으면 열 단위로 세로로 나오고],[2개이상 넣으면 행 단위로 가로로 나옴]]
df_na = pd.DataFrame([[1,2,np.nan],[1,2,3]])
df_na

   0  1    2
0  1  2  NaN
1  1  2  3.0

In [19]:
# 열 별로 다 더해줌(NaN 제외)
df_na.sum()

0    2.0
1    4.0
2    3.0
dtype: float64

In [20]:
# skipna 은 기본 값이 true이며 false로 명시적으로 주어졌을 경우 NaN을 포함하며 연산을 한다.
df_na.sum(skipna=False)

0    2.0
1    4.0
2    NaN
dtype: float64

In [21]:
df_na < 3

      0     1      2
0  True  True  False
1  True  True  False

In [22]:
df_na < 2

      0      1      2
0  True  False  False
1  True  False  False

In [23]:
# 비교 연산은 결측값(누락값)에서 사용할 수 없다.
# 비교 해봤자 다 false 가 나오기 때문
df_na < np.nan

       0      1      2
0  False  False  False
1  False  False  False

In [24]:
df_na > np.nan

       0      1      2
0  False  False  False
1  False  False  False

In [25]:
df_na == np.nan

       0      1      2
0  False  False  False
1  False  False  False